[
    {
        "id": "report21386",
        "sentences": [
            "Reviewer response for version 1",
            "General comment",
            "This is a very interesting article that compiles information relevant to an emerging and widely disseminated infection in the American continent whose complications are still under study and its impact still to be known.",
            "Specifically, there are some aspects of the review that need to be considered:",
            "Objectives:",
            "- Clearly specified focusing on the cardiovascular involvement of Chikungunya virus infection, frequency of presentation, clinical manifestations and laboratory elements such as the electrocardiogram",
            "Methodology",
            "- Articles published in French have been left out, which could be a limitation considering that the largest series of cases and their complications came from France in relation to the big outbreak on La Reunion island, and many of them published in French.",
            "- The search criteria are wide: Chikungunya AND systemic manifestations, heart, cardiac. ",
            "However, with these criteria, you could lose some reports of severe disease that do not appear under these search criteria. ",
            "Chikungunya AND mortality or Death could be included. ",
            "Also, more specific criteria could be used in order to answer the question the authors propose to find cardiovascular involvement in Chikungunya infection",
            "- The inclusion of dengue in the search and in the results escapes the objectives of this systematic review.",
            "There is no reference to the use of PRISMA checklist in this review, if it was used, make it more explicit in each of the items.",
            "Results",
            "- It is confusing and difficult to follow what results are obtained from the systematic review (40 articles) and what results are from articles not included in the review.\n",
            "- Table 1, which shows the frequency of the involvement of different organs in chikungunya can be absolutely biased since the inclusion criteria are articles with systemic involvement. ",
            "According to the search criteria, the classical form of the disease has not been included overestimating the frequency of systemic involvement.\n",
            "- It is not clear what criteria you used to classify an organ involvement as very common or extremely rare. ",
            "According to the authors, an unusual manifestation occurs between 39-20%. ",
            "This could be debatable.\n",
            "- The clinical description of the disease in terms of acute, post-acute and chronic phase is irrelevant for the purposes of this review. ",
            "Just mention the clinical aspects that are important for the objectives. ",
            "In this sense, clarify the terms used as atypical manifestations, extra-articular manifestations, systemic disease, severe disease. ",
            "They are used sometimes as synonyms and sometimes with a different meaning. ",
            "It is confusing. ",
            "It is difficult to understand why in table 1, cardiovascular manifestations are as frequent as 54% but does not appear to be so in the text of atypical presentations.\n",
            "- The entire section of cardiovascular manifestations in dengue goes beyond the purpose of the study and should not be mentioned in the results. ",
            "Comparisons with the cardiovascular compromise in chikungunya, which is appreciated, can be presented in the discussion.\n",
            "- At the end of results and before management, the paragraph of studies determining the cardiovascular outcome in patients with chikungunya should be included in conclusions.",
            "Discussion",
            "It is not clear the meaning of the phrase cardiac compromise is not so common in isolated episodes.",
            "The authors do not clearly indicate the home take messages for this study and its main contribution.",
            "Limitations: authors do not mention the limitations of their study.",
            "Conclusions: Do not correspond to purpose of the study or objectives.",
            "References",
            "In the references, it is not clear what are the articles included in the systematic review and what are included for discussion."
        ],
        "labels": [
            "Structure",
            "Structure",
            "Strength",
            "Structure",
            "Structure",
            "Other",
            "Structure",
            "Weakness",
            "Recap",
            "Weakness",
            "Todo",
            "Todo",
            "Weakness",
            "Todo",
            "Structure",
            "Weakness",
            "Weakness",
            "Weakness",
            "Weakness",
            "Recap",
            "Weakness",
            "Weakness",
            "Todo",
            "Todo",
            "Weakness",
            "Weakness",
            "Weakness",
            "Weakness",
            "Todo",
            "Todo",
            "Structure",
            "Weakness",
            "Weakness",
            "Weakness",
            "Weakness",
            "Structure",
            "Weakness"
        ],
        "pid": "6-390",
        "domain": "diso"
    },
    {
        "id": "report35010",
        "sentences": [
            "Reviewer response for version 1",
            "Thank you for the opportunity to review this article. ",
            "I have the following questions/suggestions for the consideration of the authors:",
            "- The following important reference is missing from the article, please include: Rasmussen et al. (2016) 1\n",
            "- Authors should mention that Zika migrated not only to Brazil but to the Americas.\n",
            "- What are the characteristics of the chosen hospital? ",
            "Why only one hospital was chosen? ",
            "Does the hospital has a good reliable birth defect registry?\n",
            "- There is no description of the birth defects taken into account for the paper; which CZS-type birth defects were chosen form the hospital registry? ",
            "Were the birth defects confirmed? ",
            "Was any description available in medical records? ",
            "Were X-rays available for review?\n",
            "- I agree with the authors on the importance to have birth defects surveillance systems in place. ",
            "I hope that this article will contribute to the awareness of public health authorities regarding this important issue.\n",
            "- Birth defects surveillance is needed to identify Zika related defects. ",
            "As the authors mention, the majority of infected pregnant women are asymptomatic.\n",
            "- I think it will be important to differentiate in the article between Zika virus surveillance and birth defects surveillance, and the difficulties of implementing them in Africa."
        ],
        "labels": [
            "Structure",
            "Other",
            "Structure",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Strength",
            "Strength",
            "Other",
            "Recap",
            "Todo"
        ],
        "pid": "7-159",
        "domain": "diso"
    },
    {
        "id": "report35015",
        "sentences": [
            "Reviewer response for version 1",
            "The authors present an analysis of birth defects by season from a single hospital in an unnamed West African country relative to a purported mosquito season. ",
            "Their conclusion is that the seasonality of certain types of birth defects, consistent with CZS, could be explain by Zika virus transmission in the area. ",
            "This is an interesting attempt to use available data to speculate about the impact of Zika virus on congenital defects in an endemic area. ",
            "Although this is certainly thought-provoking and supports the authors recommendation to improve surveillance for Zika virus in endemic areas, there is insufficient discussion of all of the limitations to this particular analysis which, if included, would cast doubt on their proposed conclusion.",
            "The limitation that the data are from a single hospital in an un-named location make it impossible to make any generalizable conclusions and to understand any limitations completely.",
            "Data do not exist on the underlying sero-prevalence of Zika virus infection in this population (I assume). ",
            "However, given that Zika virus infection likely results in lifelong immunity, one might not expect to see any change in CZS-like defects simply due to a low number of susceptible pregnant women. ",
            "Were the women with infants with birth defects generally younger and therefore less likely to have been previously infected? ",
            "And why wouldn't we expect children to have a high rate of infection resulting in immunity as they reach child-bearing age?",
            "Again, although difficult to determine given the lack of geographic specificity provided, there is minimal discussion in the paper of other potential causes of microcephaly; most notably rubella and malnutrition. ",
            "Although rubella-related birth defects might not be expected to show any seasonality, malnutrition might. ",
            "As might toxoplasmosis.",
            "The time period covered by this report encompasses both the Ebola outbreak and significant Yellow fever activity; both of these could cause confounding in the data.",
            "Mosquito species are quite variable in their feeding habits, optimal climactic conditions and in their vectorial capacity. ",
            "Relying on patterns of malarial disease to represent what is likely to happen with a flavivirus like Zika which is transmitted by different species of mosquitoes should be considered to be a limitation. ",
            "What about using Yellow fever or dengue disease patterns?",
            "Lastly, while I understand the argument the authors are making, I found the assertion that the maternal infection period of August through October encompassed the peak and latter half of the warm, rainy season confusing. ",
            "Based on the presented data, August through October had minimal rain and lower than average temperatures. ",
            "October through December was described as the cool, dry season although temperatures peak for the year in November through January (according to the data presented by the authors)."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Recap",
            "Strength",
            "Weakness",
            "Weakness",
            "Other",
            "Other",
            "Todo",
            "Todo",
            "Weakness",
            "Other",
            "Other",
            "Weakness",
            "Other",
            "Weakness",
            "Todo",
            "Weakness",
            "Recap",
            "Weakness"
        ],
        "pid": "7-159",
        "domain": "diso"
    },
    {
        "id": "report42312",
        "sentences": [
            "Reviewer response for version 1",
            "Title and content of this work do not fit together.",
            "What about the taxonomical issues stated at the end of the abstract? ",
            "It is not discussed in the paper.",
            "For a review, it is not very comprehensive and does not focus on Latin America. ",
            "The structure of the manuscript is not logical, starting with Rickettsia , continue with Ehrlichia , coming back to Rickettsia . ",
            "There is too much content about the USA for a short review referring to Latin America.",
            "In the table, there are a number of tick-borne diseases which do not occur in Latin America E.g. Colorado tick fever, Heartland virus diseases or Powassan encephalitis. ",
            "It is not acceptable to simply transfer data from USA to Latin America."
        ],
        "labels": [
            "Structure",
            "Weakness",
            "Todo",
            "Weakness",
            "Weakness",
            "Weakness",
            "Weakness",
            "Weakness",
            "Weakness"
        ],
        "pid": "7-1988",
        "domain": "diso"
    },
    {
        "id": "report19365",
        "sentences": [
            "Reviewer response for version 1",
            "This article reports on a probabilistic cost effectiveness of stockpiling neuraminidase inhibitor antiviral drugs to mitigate against pandemic influenza deaths.",
            "The study is methodologically sound. ",
            "The decision-theoretic approach which selects the optimal course of action based on the utility of each outcome and the probability of each outcome conditional on each decision is appropriate. ",
            "In this case the actions are whether or not to stockpile NAIs for use in a pandemic, and the outcome is the cost of the antiviral stockpile and the expected number of deaths during the shelf-life period of the antivirals.",
            "The model of the expected number of pandemic deaths identifies is structurally sound and uses various appropriate data sources to quantify uncertainties present in all the parameters.",
            "The conclusion that stockpiling NAIs is cost-effective for a sufficiently high willingness-to-pay cost per QALY follows from the model and the data used.",
            "However, I think that more attention needs to be drawn to dependency of this result to the crucial antiviral effectiveness parameter. ",
            "The methodology where all parameters are treated probabilistically in a uniform way is excellent; however additional one- or two- way sensitivity analyses are still valuable for providing insight into the effect of the most important parameters. ",
            "The authors have done this for the proportion of hospitalised cases receiving antivirals; it seems appropriate to also do this for NAI effectiveness, given the ongoing debate on the subject.",
            "I have divided further comments into three sections: major essential revisions, commentary with discretionary additions, and minor technical clarifications needed.",
            "Essential Revision",
            "------------------",
            "- As stated above, the reader would be well served with an additional figure similar to Figure 3, but plotting QALY threshold against mean NAI effectiveness. ",
            "In my shallow experimentation with the author's model, it looks like at 20,000 GBP / QALY, NAIs cease being cost effective at around 0.94 effectiveness (relative risk, compared to 0.89).",
            "Commentary",
            "----------",
            "The suggestions made below I think might improve the article however I think the authors can best judge whether the additional effort and added complexity would be worthwhile or would be too diverting.",
            "I commend the authors for including the model code in the Appendix, I managed to run this code with relatively little effort.",
            "- The methodology of using expert opinion to mitigate potential bias in the studies estimating NAI effectiveness is a practical measure that is probably worthwhile. ",
            "Some additional detail on the process would be appreciated. ",
            "For example: how were assessors selected? ",
            "How much time did the reviewers take in their bias estimates?\n",
            "- In the discussion it could be noted that in a future pandemic with a large CAR or CFR, the proportion of severe cases receiving hospital care and the level of care are likely to be lower, simple due to hospitals being overwhelmed. ",
            "The estimates of proportion of deaths occurring in hospital are from the 2009 pandemic which was very mild.\n",
            "- If NAIs have any effect in preventing further transmission, e.g if they shorten the period of viral shedding, then mass administration of antivirals may reduce the overall attack rate and consequent mortality even if NAIs are not effective for mortality reduction of severe cases. ",
            "As the study's model does not capture this, this is another way in which the study is conservative.",
            "Minor Technical Revisions",
            "-------------------------",
            "- The CAR and CFR parameters used in the model are for a pandemic without NAI usage. ",
            "Given that NAIs were used in the 2009 pandemic, should the CAR and CFR estimates for 2009 be included along side those of previous pandemics? ",
            "If the 2009 CAR and CFR estimates are for example based on global data where NAI usage might be negligible that would be OK; but if they are based primarily on UK or US data they should possibly be excluded.\n",
            "- In the Appendix page 4 there is a citation [20] that isn't given in a reference list.\n",
            "- In the last sentence of the 3rd paragraph, the RR derived based on the OR and 10% mortality is stated as 0.89. ",
            "This is the same as the bias-corrected RR given in the next paragraph. ",
            "Is this intentional? ",
            "Or should it be the RR value based on the OR and 10% mortality (but without bias correction), in which case it should be 0.825 (from the formula).\n",
            "- The R / BUGS code in the Appendix worked almost without alteration. ",
            "I found that I had to: Install BUGS (OpenBGUS). ",
            "Hoist the npv function to the top. ",
            "Remove the codaPkg=TRUE setting to obtain a result object. ",
            "(also the \"obs\" and \"qaly\" values appear to be dead code) ",
            "If F1000 allows additional appendix files this could be supplied as an additional plain ASCII file, to avoid scraping the text from the PDF and correcting resulting formatting.\n",
            "- I can't find the support for the n_hosp data value of 136. ",
            "The tot_hosp value of 125 appears in the Donaldson BMJ paper. ",
            "That paper gives 138 for the total number of confirmed deaths due to pandemic influenza."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Strength",
            "Strength",
            "Recap",
            "Strength",
            "Recap",
            "Todo",
            "Strength",
            "Todo",
            "Other",
            "Structure",
            "Structure",
            "Todo",
            "Recap",
            "Structure",
            "Structure",
            "Other",
            "Strength",
            "Strength",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Weakness",
            "Other",
            "Weakness",
            "Structure",
            "Structure",
            "Recap",
            "Todo",
            "Todo",
            "Weakness",
            "Recap",
            "Recap",
            "Todo",
            "Todo",
            "Strength",
            "Other",
            "Other",
            "Other",
            "Other",
            "Todo",
            "Weakness",
            "Other",
            "Other"
        ],
        "pid": "5-2293",
        "domain": "diso"
    },
    {
        "id": "report36742",
        "sentences": [
            "Reviewer response for version 1",
            "We thank the authors for this very interesting study. ",
            "We have some comments and suggestions which we think will enhance the manuscript.",
            "1.",
            "The primary outcome measure is the citation counts from publications associated with the successful application. ",
            "Publications were produced from 1 to 8 years after the peer review date (average 4.3 years). ",
            "This does not appear to take account of varying time since the projects were funded (i.e. 7 year gap between projects that were funded from 1999 to 2006). ",
            "Thus, older studies would have had more time for publications to be produced and cited. ",
            "We therefore suggest a more meaningful outcome measure would be either the number of citations per year per study, or the total number of citations in, say, the 5 years following the final project report, or some other standardised project milestone. ",
            "Adding the review year to the model does not seem to adequately control for this factor (though qualified statistical advice is needed to clarify this). ",
            "We think this is the issue that likely affects the interpretation of the results the most in our critique.",
            "2.",
            "The number of citations was standardised by academic field – i.e. molecular biology. ",
            "Was there any variation in study designs within this field that might also change the expected number of citations (e.g. systematic reviews may attract more citations than primary experimental studies in some fields)? ",
            "It would be useful for context if there could be a table with some basic aggregate details of the funded studies, such as types of study design, molecular biological application, study sample characteristics, duration of study etc. ",
            "This would help to put the results into context.",
            "3.",
            "The impact of a piece of research on which referees could not agree might be either lower or higher than those on which they could. ",
            "So, it would be useful to plot the standard deviation of the citations against the standard deviation of the peer review score.",
            "4.",
            "As well as using multiple imputation to correct for missing data, a sensitivity analysis in which cases with missing data are omitted would be useful.",
            "5.",
            "Some measure of the model fit would be useful, eg. ",
            "adjusted R squared",
            "6.",
            "There was a wide variation in the number of reviewers per article from 2 to 18. ",
            "Was this due to differences in the kind of research, amount of funding requested or some other perceived risk on behalf of the funder? ",
            "Could this artificially influence the standard deviation of the score, confounding any association with citations?",
            "7.",
            "Fractional polynomial model results are only presented for the best fitting model with the smallest deviance. ",
            "This is acceptable in principle, but it would be useful for the authors to comment on whether there was any variation in the results according to the other fractional polynomial transformations (if available). ",
            "This will provide confidence in the robustness of the findings.",
            "8.",
            "Reference is made in the first paragraph to a “recent systematic review” by Guthrie et al (2018 1 ) (and also in the third paragraph). ",
            "We note that this publication doesn’t refer to itself as being a systematic review, and indeed, it is an update of a 2009 review which describes itself as a non-systematic review. ",
            "We would suggest using the tern “non-systematic review”, or just “literature review”.",
            "9.",
            "Thank you for citing our own recent systematic review on peer review of grants in health. ",
            "You mention that the review included eight studies and called for further research in this area, which is correct. ",
            "However, the review focused specifically on studies aiming to improve the effectiveness and efficiency of peer review. ",
            "These were drawn from a wider set of 83 studies on peer review which we systematically mapped. ",
            "In the map there were some studies which focused on assessing the impact of funded research, eg. ",
            "In terms of bibliometrics. ",
            "Thus, there is a body of evidence on this topic, though we didn't systematically review it in detail. ",
            "We are happy to provide you with a list of these studies.",
            "10.",
            "The sentence on page 3 beginning “A recent systematic review found “suggestive” evidence that funding peer review can have an anti-innovation bias 2 and that innovation and risk may not often be sufficiently addressed in review feedback 7 ” needs re-wording as not only is the Guthrie et al paper a non-systematic review, but the second reference cited in that sentence by Gallo et al is a survey (i.e. not a review at all). ",
            "The way the sentence is phrased implies that it is a systematic review.",
            "11.",
            "Suggest amending the sentence on page 3 “Many studies using large sample sizes found either no association or only a weak association between the mean score and the VOLUME of citations of subsequent publications”"
        ],
        "labels": [
            "Structure",
            "Strength",
            "Other",
            "Structure",
            "Recap",
            "Recap",
            "Weakness",
            "Other",
            "Todo",
            "Weakness",
            "Weakness",
            "Structure",
            "Recap",
            "Todo",
            "Todo",
            "Other",
            "Structure",
            "Other",
            "Todo",
            "Structure",
            "Todo",
            "Structure",
            "Todo",
            "Todo",
            "Structure",
            "Recap",
            "Todo",
            "Todo",
            "Structure",
            "Recap",
            "Todo",
            "Other",
            "Structure",
            "Recap",
            "Weakness",
            "Todo",
            "Structure",
            "Other",
            "Recap",
            "Other",
            "Other",
            "Other",
            "Other",
            "Other",
            "Other",
            "Structure",
            "Todo",
            "Weakness",
            "Structure",
            "Todo"
        ],
        "pid": "7-1030",
        "domain": "scip"
    },
    {
        "id": "report71160",
        "sentences": [
            "Reviewer response for version 1",
            "Congratulations to the authors. ",
            "Despite sporotrichosis remains a neglected disease in terms of research interest, funding and medical attention, to which the authors have made significant contributions. ",
            "However, this study has several major observations:",
            "Methods.",
            "The literature search is limited to two databases. ",
            "Fig. 1. ",
            "Present a flow, and follow the guidelines of a scoping review.",
            "MedLine / Pubmed and Abstracts of Scientific Conference should be reviewed.",
            "There are several published studies on sporotrichosis in journals indexed in SCIELO, LiLACS, etc. ",
            "These papers have not been included in the study.",
            "I don’t think that this article contains enough robust data to evidence the implications for practice. ",
            "The strategy and organization of the information about Implications for practice is not appropriate. ",
            "A set of words related to tentative language is biased. ",
            "Furthermore, only the abstracts have been reviewed. ",
            "To evaluate the implications in practice, it is necessary to organize the different types of published studies: case series, observational study, clinical trials and systematic review, diagnostic test, etc. ",
            "Furthermore, studies not related to the clinical practice of sporotrichosis should be excluded.",
            "Results:",
            "Paragraph 1. ",
            "I suggest include in Results section include the statistical test.",
            "Scientific production by hyperendemic areas of sporotrichosis should be presented.",
            "Table 3. ",
            "I suggest to make a comparison between Brazil, USA, Mexico, China, or hyperendymic areas of sporotrichosis.",
            "The authors should include the different types of published articles: review, original, short communication, case reports, clinical trial, systematic, review, correspondece, Research Letters, etc.",
            "Research trends. ",
            "It would be interesting to know how these trends vary between Latin America. ",
            "Europe and Asia.",
            "Implications for practice",
            "I suggest organizing the published studies: case series, observational study, clinical trials and systematic review, diagnostic test, etc. ",
            "Although there are very few clinical trials and systematic reviews on sporotrichosis, this evidence should be presented in tables. ",
            "Furthermore, studies not related to the clinical practice of sporotrichosis should be excluded.",
            "Finally, sporotrichosis is not limited to dermatology.",
            "Discussion",
            "In the “Discussion” section I would have wished to see more information on implicance practic .",
            "Limitations should be described and discussed such as: the number of databases included in the study, the studies were not classified, to differentiate the type of scientific evidence for clinical practice, etc."
        ],
        "labels": [
            "Structure",
            "Other",
            "Strength",
            "Structure",
            "Structure",
            "Weakness",
            "Structure",
            "Todo",
            "Todo",
            "Other",
            "Weakness",
            "Weakness",
            "Weakness",
            "Weakness",
            "Weakness",
            "Other",
            "Todo",
            "Structure",
            "Structure",
            "Todo",
            "Todo",
            "Structure",
            "Todo",
            "Todo",
            "Structure",
            "Todo",
            "Todo",
            "Structure",
            "Todo",
            "Todo",
            "Todo",
            "Other",
            "Structure",
            "Todo",
            "Todo"
        ],
        "pid": "9-654",
        "domain": "scip"
    },
    {
        "id": "report20768",
        "sentences": [
            "Reviewer response for version 1",
            "This survey represents an important contribution to our understanding of career satisfaction among early career researchers. ",
            "As you note, many efforts have focused on the US, so this study is especially valuable in light of its focus on the UK. ",
            "However, the opt-in nature of the survey should be disclosed in the abstract, and several other parts of the manuscript could be productively modified.",
            "Methods",
            "- Please explain how the survey was advertised and what target audiences were likely reached.\n",
            "- Since you have IP addresses, can you report how many of the responses came from within the UK and how many were from academic institutions? ",
            "The former would be essential support for the claim that the report is representative of ECRs in the UK.\n",
            "- Furthermore, can you compare age and other factors to any known statistics to evaluate how representative your sample is in these dimensions?",
            "Results",
            "- Please clarify whether the term “research” is used to mean academic research or research in industry as well. ",
            "If the latter, did any of the survey respondents identify as industry researchers? ",
            "For example, at the end of the section on PhD students, you write that 28% plan on leaving academia, yet the question asks about research - a very important distinction. ",
            "Furthermore, I’m not sure that the fact that “only 28%” are planning on leaving is surprising, since the respondents did not provide information about their available alternatives.\n",
            "- In the postdoc section, the statement “the large majority that didn’t feel comfortable in a future in research felt that they were working too hard” does not make sense at only a 33% response rate.\n",
            "- Throughout, it would be helpful to provide the actual # of responses received, especially when discussing a fraction of a category (for example, X% of postdocs, etc).",
            "Discussion",
            "- Science can offer non-financial rewards, such as the pleasure of doing research and a relatively high level of respect. ",
            "Therefore I suggest providing a caveat {indicated} to the sentence: ",
            "“Working long hours and over weekends for relatively little {financial} reward”\n",
            "- Regarding the statement “it is probable that some fraction of [researchers stating their intention to leave] will decide to remain, and the number who actually do leave may well be lower.” ",
            "Rather than speculate, can you compare this to existing data on attrition rate, for example figure 1.6 from the 2010 Royal Society report “The Scientific Century” 1 ?",
            "Figures",
            "- Box 1-3: ",
            "The colored bullet points are distracting - does the color code have meaning?\n",
            "- Figure 1: ",
            "This graphic is extremely difficult to read. ",
            "Please label the pie chart sections directly (or better yet, make it a histogram) and provide axis titles and labels for all of the graphs. ",
            "This will make the legends unnecessary. ",
            "The “days per week” visualization would be much better represented by a distribution. ",
            "PhD (which is ambiguous and should perhaps be PhD student), Postdoc, and PI labels are unnecessarily large.\n",
            "- The data on comfort with long term prospects in research are very interesting. ",
            "I would like to see a graphical representation of this as well."
        ],
        "labels": [
            "Structure",
            "Strength",
            "Strength",
            "Todo",
            "Structure",
            "Todo",
            "Todo",
            "Other",
            "Todo",
            "Structure",
            "Todo",
            "Todo",
            "Recap",
            "Weakness",
            "Weakness",
            "Todo",
            "Structure",
            "Other",
            "Todo",
            "Todo",
            "Recap",
            "Todo",
            "Structure",
            "Structure",
            "Todo",
            "Structure",
            "Weakness",
            "Todo",
            "Other",
            "Todo",
            "Weakness",
            "Strength",
            "Todo"
        ],
        "pid": "6-229",
        "domain": "scip"
    },
    {
        "id": "report20903",
        "sentences": [
            "Reviewer response for version 1",
            "This paper addresses an important gap in the available data regarding the biomedical workforce in the UK. ",
            "Although larger studies are needed (both in the scope of the questions asked and with a larger and more representative population of respondents), this survey is a nice example of how members of the community can begin to address the gaps in existing data collection and dissemination efforts.",
            "Abstract",
            "Please include the number of respondents analyzed and mention something about how the survey was advertised/the target audience. ",
            "(The caveats about survey responses necessarily being biased to those who were aware of it and cared enough to take the time to respond are buried fairly far into the discussion, and it would be helpful to make some reference to this a little earlier in the paper.)",
            "Data presentation",
            "Please state clearly throughout the text the number of responses analyzed in each category. ",
            "(How many UK-based biomedical researchers responded to the survey? ",
            "How many PhD student and postdoctoral respondents were there? ",
            "Etc.)",
            "It would be interesting to include a figure showing responses to the final question (how comfortable do you feel about your long-term prospects in research?\"); ",
            "as respondents had the option to select multiple answers, it would be nice to see the percentage selecting each of the possible answers.",
            "For clarity, the colorblind, and those who still prefer to print papers in black and white, it would be preferable to directly label the data in figure 1, rather than using the key. ",
            "Please label the percentage of respondents in each age group; and label graph axes. ",
            "Though more typical for an infographic than a figure in a paper, I do like the text boxes highlighting the take-home message for each panel.",
            "I also initially found the visual representation the hourly salary data somewhat confusing; it might make more sense to make the \"hourly salary\" its own panel, with bars for minimum wage, PhD, postdoc, and PI average hourly pay (rather than showing the minimum wage three times). ",
            "The hourly salary numbers could be included in or above each bar.",
            "Could you clarify the way average hourly wages are calculated? ",
            "I noticed for grad students, you assumed a 48-hour work week, while for postdocs the assumption was a 45-hour work week, and I didn't see a number for PIs. ",
            "Were the assumptions supposed to represent a \"typical\" respondent, or an average?",
            "Future directions for the survey",
            "I hope that data collection and analysis for this project will continue. ",
            "I have a few minor suggestions, should the survey be revised.",
            "- I found it somewhat confusing that the category for (predoctoral) graduate students appears to be \"PhD researcher.\"\n",
            "- While I understand the importance of keeping such a survey short, it might be helpful to collect some additional demographic data, such as gender, relationship/marital status (and if partnered, the partner's salary and discipline), and number of children.",
            "Overall, this work addresses an important knowledge gap. ",
            "I hope data collection will continue and that in future the survey questions can be expanded and the survey itself advertised more broadly."
        ],
        "labels": [
            "Structure",
            "Strength",
            "Strength",
            "Structure",
            "Todo",
            "Todo",
            "Structure",
            "Todo",
            "Todo",
            "Todo",
            "Other",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Strength",
            "Todo",
            "Todo",
            "Todo",
            "Recap",
            "Todo",
            "Structure",
            "Other",
            "Other",
            "Weakness",
            "Todo",
            "Strength",
            "Other"
        ],
        "pid": "6-229",
        "domain": "scip"
    },
    {
        "id": "report36897",
        "sentences": [
            "Reviewer response for version 1",
            "The authors report on the usage of IDPs by postdoctoral scholars, which is both a timely and fundamental topic within the broader graduate and postdoctoral professional development community. ",
            "This work extends beyond the authors’ recently published article on IDP usage among doctoral students 1 to showcase how the instrument is currently being used by postdocs. ",
            "The aforementioned manuscript on doctoral IDP usage extensively discusses policy and other issues surrounding IDPs, while this manuscript is lean on discussion. ",
            "It would therefore benefit from including prior literature on correlates of success associated with postdocs who have written plans—which would have the added benefit of placing this work into a broader context (for example, see: Davis 2009 2 ).",
            "There are a number of points that should be addressed, and they are outlined as follows:",
            "- The survey instrument asks questions on a 5-point Likert scale of strongly agree, agree, neutral (neither agree nor disagree), disagree, & strongly disagree. ",
            "However, when analyzing the data, the authors report percentages either as ‘does not agree’ (also reported as ‘disagree’) or ‘agree’ - with ‘strongly disagree, disagree & neutral’ all grouped together as a ‘does not agree’ response. ",
            "It seems that lumping “neutral (neither agree nor disagree)” into the ‘does not agree’ category would skew results (both in this manuscript and the manuscript on doctoral IDP usage) towards ‘does not agree.’ ",
            "It is recommended that the authors reanalyze the data and report the ‘neutral’ responses as a third category in order to more accurately reflect intended answers/percentages.\n",
            "- I agree with reviewer 1 that it is unclear how the authors calculated that 54% completed an IDP; like reviewer 1, I also calculated that 61% completed an IDP either with or without their PI. ",
            "Similarly, I also agree with reviewer 1 that it is unclear where the 38.4% value came from (percent of respondents that completed an IDP who found the tool helpful). ",
            "Furthermore, in figure 1, a value of 22.4% of all respondents (whether they complete an IDP or not) is listed as saying the IDP process is helpful to their career development. ",
            "Since “22.4%” also includes those who never completed an IDP, reporting it in this manner seems to bias perceptions of the tool as unhelpful.\n",
            "- Aside from the unclear derivation of percentages discussed in point #2, the questions in the survey instrument do not seem to allow confident discernment of who actually completed an IDP. ",
            "For example, respondents who disagree with the question “I complete an IDP annually with my PI/advisor” could have actually completed an IDP with their PI at the beginning of their postdoc and/or possibly in year 3 of their postdoc—how much weight were respondents giving to the word ‘annually’? ",
            "Another question reads: “I complete an IDP but I do not discuss it with my PI/advisor” - could respondents complete two different IDPs - one with and one without their PI (and thus agree to both the former and latter questions)?\n",
            "- The authors assert that the usefulness of an IDP has decreased since 2014, specifically comparing their results to that in (Hobin et al. 2014 3 ). ",
            "However, in the (Hobin et al. 2014) paper, an IDP’s overall value is reported either as ‘not helpful’ ‘neutral’ or ‘helpful’. ",
            "It seems that the results in this manuscript could be compared more accurately with the (Hobin et al. 2014) data by showing the ‘neutral’ responses, rather than lumping them with ‘does not agree’ (see point 1 above). ",
            "Additionally, it would be helpful to point out the limitations of comparing these two studies (ex: address key differences between the two survey instruments regarding how the IDP questions were asked (and how this might bias responses), address potential respondent audience differences, etc.).\n",
            "- Like reviewer 1, I also feel that there are limited questions that address what one might consider IDP ‘effectiveness.’",
            "’ The manuscript would thus be strengthened by discussing IDP indicators that have been previously reported in the literature (such as measures outlined by (Hobin et al. 2014) - ex: the value of an IDP in helping with self-assessment, helping identify career paths, helping identify skills to strengthen, etc.). ",
            "Furthermore, (Davis 2009 2 ) reports an in-depth analysis of results from a Sigma Xi Postdoc Survey - identifying many positive correlates of success associated with postdocs who develop a written plan at the outset of their careers (ex: higher publication rate, grant submission rate, better supervisor relationships, etc.). ",
            "Since the main point of this manuscript is to discuss the use and effectiveness of IDPs among postdocs, it would benefit from elaborating upon such postdoc-specific contextual literature - as well as other literature that documents the general benefits of goal-setting, which is a primary function of IDPs (Locke et al. 2002 4 ).\n",
            "- (Minor) The authors indicate that “additional research is needed,” and it would thus be beneficial to clarify the research questions that should be addressed. ",
            "For example, it seems that it would be useful to determine the effects of various parameters on IDP effectiveness such as: 1) when in training an IDP is completed; 2) inclusion/ exclusion of IDP components (such as self-assessment, career exploration, skill-building, goal-setting, etc.); 3) prior experience with/completion of an IDP as a PhD student; 4) completing an IDP of their own accord versus doing so because it is required; 5) receiving training on how to create/implement an IDP; 6) using a specific IDP instrument (ex: myIDP) versus an institutionally-developed IDP, etc..\n",
            "- (Minor) ",
            "As an additional point - since ‘IDP effectiveness’ is subjective as the authors point out, perhaps future studies should address better-defining these parameters so that common IDP evaluation methods can be adopted within the broader community. ",
            "It would also be especially helpful to ascertain what IDP tools are being used, and how they are being implemented so that standard ‘correlates of effectiveness’ could be tied to specific IDP instruments (or components) and the manner in which they are employed."
        ],
        "labels": [
            "Structure",
            "Strength",
            "Recap",
            "Other",
            "Todo",
            "Structure",
            "Recap",
            "Recap",
            "Weakness",
            "Todo",
            "Weakness",
            "Weakness",
            "Recap",
            "Weakness",
            "Weakness",
            "Todo",
            "Todo",
            "Recap",
            "Weakness",
            "Todo",
            "Todo",
            "Weakness",
            "Todo",
            "Other",
            "Todo",
            "Todo",
            "Todo",
            "Structure",
            "Todo",
            "Other"
        ],
        "pid": "7-1132",
        "domain": "scip"
    },
    {
        "id": "report59681",
        "sentences": [
            "Reviewer response for version 1",
            "The authors provided an R package for the QRISK3 algorithm to predict the risk of cardiovascular disease. ",
            "My main comment is related to the size of this package, which has only one simple function with two simple datasets. ",
            "I am not sure that this tiny package can be presented as an F1000Research article. ",
            "There are not any new findings represented in this article compared to the author's previous works. ",
            "I suggest enriching this package with more visualization and data manipulation functions and datasets. ",
            "Besides, I do not think it needs to highlight validation of R performance with SAS or C. This is part of your quality control, not an outcome. ",
            "Also, I have some minor comments:",
            "- Why didn't you use the R 3.6.2 instead of 3.4.2?\n",
            "- Why you did not make the categorical variables as ordered factor R object instead of a simple numeric object? ",
            "(in this case, you do not need to think about the conflict of the meaning of \"1\" and \"0\").\n",
            "- The range of patient ages is not consistent between text and table.\n",
            "- \"Height\", \"Weight\" and \"Weight/Height\" in table 1 should be lowercase the same as the package."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Other",
            "Weakness",
            "Weakness",
            "Todo",
            "Weakness",
            "Structure",
            "Todo",
            "Todo",
            "Other",
            "Weakness",
            "Todo"
        ],
        "pid": "8-2139",
        "domain": "rpkg"
    },
    {
        "id": "report55117",
        "sentences": [
            "Reviewer response for version 1",
            "The authors introduce an R package that provides an easy way to set up a workflow for data analysis using R and publish results to a web page.",
            "The workflowr package seems to work well and appears to be widely used.",
            "What is relatively novel about this package is that while most workflow tools I have seen in R concentrate on setting up a directory structure, syntax files and producing output and reports from analyses, this package adds both the ability to publish the results to web pages and also to set up a Github or Gitlab project repositories with minimal effort.",
            "The article is clear and well written as are the associated vignettes. ",
            "The underlying functions in the R are also well written but perhaps could employ more error checking and reporting (see below).",
            "While I am unlikely to use this approach myself I think it is an excellent approach for new users since it",
            "- sets up a project skeleton with instructions,\n",
            "- encourages users to document their project and workflow right from the start, and\n",
            "- also the package provides quite a few helpful vignettes and guides for various scenarios that should be useful for those starting in the area.",
            "However, I do have minor reservations with the approach outlined, including",
            "- for new users, they must not only learn R but also R Markdown which adds an extra level of complexity;\n",
            "- while it seems necessary in workflowr, users do not really need to use R Markdown files to produce well documented code (see https://rmarkdown.rstudio.com/articles_report_from_r_script.html ) but R Markdown seems better suited to reports and articles;\n",
            "- the workflow is very R Markdown-centric: experienced users may wish to employ R or other software directly or a build system like Make or drake. ",
            "While this is relatively straight forward outside of the package, e.g. by adding these to the git repository outside of the package and using employing R directly to update intermediate results the article or documentation do not give any details;\n",
            "- some functions do not appear to be particularly error-proof for new users, e.g. wflow_git_config will overwrite existing settings without checking or even providing a warning although this may conceivably change in future; and\n",
            "- new users will undoubtedly run into git merge issues and the version I reviewed (1.4.0) did not seem to cater for such eventualities although this appears to have been addressed according to the change log in the latest version (1.5.0).",
            "Minor comments are:",
            "- I am not sure why only some of the software on page 3 is cited when presumably a reader may benefit from the author's recommendations appropriate to the data analysis workflow area rather than tracking down a general reference for themselves;\n",
            "- while it is good that the potential pitfalls of using git directly or using git reset are addressed on page 11, it may also prove useful for readers to address limitations and potential pitfalls in more depth, perhaps not in the article but with reference to other material or vignettes. ",
            "For example, users at all levels might benefit from knowing where to get help on merge conflicts, whether users with large data sets should consider databases rather than git or whether typical git workflows like branching would work with this package,\n",
            "- it would be nice to see how this package compares to other alternatives like drake but admittedly the scope this article is more an introduction to the workflowr package.",
            "In summary, this article is clear and well written. ",
            "The package is an original contribution to the range of software addressing reproducibility and workflow in data analysis projects."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Strength",
            "Strength",
            "Strength",
            "Strength",
            "Strength",
            "Recap",
            "Recap",
            "Strength",
            "Structure",
            "Weakness",
            "Weakness",
            "Weakness",
            "Weakness",
            "Weakness",
            "Weakness",
            "Structure",
            "Weakness",
            "Todo",
            "Other",
            "Todo",
            "Strength",
            "Strength"
        ],
        "pid": "8-1749",
        "domain": "rpkg"
    },
    {
        "id": "report55119",
        "sentences": [
            "Reviewer response for version 1",
            "I like the workflowr package and I like the paper. ",
            "Nicely written.",
            "Reproducibility is a big thing and workflowr lowers the entrance barrier for non technical users. ",
            "This is a huge benefit.",
            "The package has has already some visibility (judging based on GitHub stars) and is being adopted to various applications (based on examples presented in the paper).",
            "I recommend to accept the paper.",
            "Here are some comments that authors may consider:",
            "- A. ",
            "The point that I am missing the most is the comparison against the drake package. ",
            "These two packages seems to be similar, maybe complementary. ",
            "Can they be used together? ",
            "It would be good to show pros and cons/similarities and differences.\n",
            "- B. ",
            "I like the workflowr package it is a useful tool. ",
            "What I am missing is the methodology / description of a process / good practices of how the reproducible analysis should look like. ",
            "This would be very useful for people that look for precise guidelines on how to integrate the workflowr with every day practice. ",
            "Wet labs researchers are used to \"protocols\" that directly guide step by step what to do during the analysis. ",
            "Maybe it would be possible to give such protocols for reproducible research with the workflowr package.\n",
            "- Just to give an example, in the Model Development Process ( https://arxiv.org/abs/1907.04461 ) article there is an overview of phases and tasks shared across model development. ",
            "In which phases the workflowr or similar tools shall be used?\n",
            "- C. ",
            "Authors have mentioned blogdown and bookdown packages. ",
            "I think that even a closer match to the reproducibility problem is the package modelDown (see https://joss.theoj.org/papers/10.21105/joss.01444 or GitHub http://github.com/ModelOriented/modelDown ). ",
            "1 The modelDown package takes predictive models and creates a HTML website with information about session info, binary models, training/test data and model explanations. ",
            "The website is created without any additional effort. ",
            "ModelDown automates the most boring part of the modeling i.e. model documentation.\n",
            "- D. ",
            "When mentioning tools for archivisation of binary objects, it may be also useful to add the pins package recently developed by RStudio (https://cran.r-project.org/web/packages/pins/index.html). ",
            "It is more limited than other mentioned packages (do not keep information about meta data) but quickly gains popularity.\n",
            "- E. ",
            "After the \"Unfortunately, this ideal is not usually achieved in practice; most scientific articles do not come with code that can reproduce their results\" maybe authors could share their thoughts why it is the case. ",
            "It will be useful to list specific reasons why reproducibility fails. ",
            "Is it primarily because we do not have proper software, or they software is too complex, or one needs to pay for the proper software, or researchers are not aware of the problem?"
        ],
        "labels": [
            "Structure",
            "Strength",
            "Strength",
            "Other",
            "Strength",
            "Strength",
            "Strength",
            "Structure",
            "Structure",
            "Weakness",
            "Other",
            "Todo",
            "Todo",
            "Structure",
            "Strength",
            "Weakness",
            "Other",
            "Other",
            "Todo",
            "Other",
            "Todo",
            "Structure",
            "Recap",
            "Other",
            "Other",
            "Other",
            "Other",
            "Structure",
            "Todo",
            "Other",
            "Structure",
            "Todo",
            "Todo",
            "Todo"
        ],
        "pid": "8-1749",
        "domain": "rpkg"
    },
    {
        "id": "report55176",
        "sentences": [
            "Reviewer response for version 1",
            "The workflowr package, available from CRAN for 1.5 years, has already demonstrated itself to be a valuable contribution to improving the reproducibility of scientific analyses. ",
            "This paper does a thorough job setting out the rationale, design, and implementation of the workflowr package. ",
            "It is clear that the authors have spent considerable time thinking about some of the key challenges of this endeavour, learning about best practises, getting feedback from users, and implementing these using 4 key technologies/features:",
            "- Version control.\n",
            "- Literate programming.\n",
            "- Automatic checks and safeguards to improve code reproducibility.\n",
            "- Sharing code and results via a website.",
            "The paper is clearly written and I am happy to approve the article in its current form.",
            "Some minor comments, queries, and corrections are given below:",
            "- Figure caption 1: '\"analyses\" folder' is '\"analysis\" folder' in the figure.\n",
            "- p5: Re workflowr executing code in a clean session. ",
            "My impression was that rendering Rmarkdown documents, at least when done by clicking the 'knit' button in RStudio, was already run in a separate process. ",
            "But I may be mistaken and perhaps this is different from running `rmarkdown::render_site()`?\n",
            "- Regarding published sites. ",
            "Not all scientific analyses can be made public, particularly in the early stages. ",
            "Some discussion of options available for private/protected hosting would be valuable.\n",
            "- I'm a little wary of relying on raw.githack.com for hosting past versions of the webpages. ",
            "For example, what if the service becomes unavailable? ",
            "Does or could workflowr support other hosting services?\n",
            "- p11: Is the idea of a 'centralized workflowr project website' like that of the homepage https://bookdown.org/ or for an organisation/user to share their personal workflowr projects?"
        ],
        "labels": [
            "Structure",
            "Other",
            "Strength",
            "Strength",
            "Recap",
            "Recap",
            "Recap",
            "Recap",
            "Strength",
            "Structure",
            "Weakness",
            "Structure",
            "Other",
            "Todo",
            "Structure",
            "Other",
            "Todo",
            "Weakness",
            "Other",
            "Todo",
            "Todo"
        ],
        "pid": "8-1749",
        "domain": "rpkg"
    },
    {
        "id": "report8554",
        "sentences": [
            "Reviewer response for version 1",
            "Needs more figures to demonstrate why a user would choose this tool. ",
            "For example http://leekgroup.github.io/regionReportSupp/bumphunter-example/index.html (but even better would be to show an example, e.g. ITGB2 exon inclusion/exclusion or multiscale DMRs, where in our hands at least, nothing else short of IGV really does the job, and IGV doesn't do it that well.) ",
            "The software is a firm foundation but the writeup needs work if it is to be compelling and thus influence readers to try out an unfamiliar tools.",
            "My apologies for being harsh, but without figures, an applied paper simply will not be read. ",
            "I would be less harsh if the underlying work were not compelling enough to command broader interest. ",
            "A poor writeup will doom the work to obscurity."
        ],
        "labels": [
            "Structure",
            "Todo",
            "Todo",
            "Todo",
            "Weakness",
            "Other",
            "Other"
        ],
        "pid": "4-105",
        "domain": "rpkg"
    },
    {
        "id": "report8559",
        "sentences": [
            "Reviewer response for version 1",
            "The authors present regionReport, an R package to produce interactive HTML reports from a genomic-region based analysis, such as those produced by derfinder, bumphunter or DiffBind. ",
            "The report shows quality control summaries, interactive tables of the most significant regions, and information on how regions lie in exons, introns, and intergenic regions. ",
            "Both novice and expert genomicists are sure to gain much from this, and the paper clearly and concisely explains the software and its use, while providing useful examples and instructions.",
            "The idea of producing common reports for a Bioconductor object is ingenious, and will hopefully inspire packages for other types of biological data. ",
            "One of the great strengths of the package is the reproducibility practices it follows. ",
            "For example, the section at the end of the produced report that shows reproducibility information, such as the original command, the session info, and the amount of time the report took to generate, is a great idea. ",
            "(Indeed, the option to add sessionInfo() and timers could probably be baked into rmarkdown, or a thin wrapper thereof). ",
            "Another strength is the use of modern knitr templates, such as expandable tables. ",
            "Scientists who want to develop automated reports should use this package as a guide.",
            "Overall my concerns are minor, and mostly concern the package rather than the paper, some of which I attempt to address in a GitHub pull request .",
            "In pull request",
            "- If the renderReport function leaves early (for example, if it is interrupted by the user hitting Stop) it strands the user's R session in a working directory. ",
            "Using the on.exit function, as described here , lets R return to the original directory instead.\n",
            "- The options for customization of the report are limited, by the customCode argument, to chunks between the main text and the reproducibility section. ",
            "Genomicists may wish to take advantage of these reports while customizing some of their outputs. ",
            "(For example, the authors of region-finding packages may wish to wrap renderReport with a customized template for their own objects). ",
            "I've added a template argument in my pull request, and go over another suggestion below.",
            "Not in pull request",
            "- The `template` argument is a start towards greater customization, but a further improvement would be to allow the user to provide a list of customized internal chunks (for example, density-pvalue). ",
            "As it is now, these are constructed in the renderReport function and cannot be altered without rewriting the entire function. ",
            "This suggests finding a way to abstract them, such as bringing them in from a separate file, would be useful.\n",
            "- As one example of an important customization I'd make: the reports show density plots of p-values and q-values, but in my experience genomicists are more accustomed to histograms (especially since bumps in density plots may be misleading, while histograms can get a better sense of which bumps are meaningful). ",
            "I understand if the authors wish to keep it as a density plot, but if so I would appreciate a way to change it for my own use.",
            "Minor issues",
            "- The use of \"smart quotes\" in code within the PDF, such as source (“http://bioconductor.org/biocLite.R”), make it inconvenient to copy and paste them into an R terminal. ",
            "If there's any way this could be remedied by the author or editors, it should."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Recap",
            "Strength",
            "Strength",
            "Strength",
            "Strength",
            "Todo",
            "Strength",
            "Strength",
            "Other",
            "Structure",
            "Weakness",
            "Other",
            "Recap",
            "Other",
            "Other",
            "Other",
            "Structure",
            "Todo",
            "Weakness",
            "Todo",
            "Todo",
            "Todo",
            "Structure",
            "Weakness",
            "Todo"
        ],
        "pid": "4-105",
        "domain": "rpkg"
    },
    {
        "id": "report59875",
        "sentences": [
            "Reviewer response for version 1",
            "The author presents a R based toolset for the analysis of ChIP-seq data in a GUI framework. ",
            "The construction of R based ChIP-seq analysis pipelines affords the potential for the use of wide range of tools from R and Bioconductor libraries while offering a low dependency piece of software.",
            "ChIPdig uses QuasR, a wrapper for Bowtie, for the alignment of ChIP-seq data from a BSGenome object. ",
            "The Rbowtie2 and Rsubread packages are now both available on Windows, Mac and Linux systems and should be considered alongside Bowtie. ",
            "I believe they would offer significant speed and memory usage improvements over QuasR. Although these do not accept BSGenome objects, ChIPdig could easily generate the FASTA from these packages for use with indexing steps of both packages.",
            "Blacklisted regions should be considered in this tool as they have been shown to have strong effects on the QC, fragment length estimation and between sample normalisation. ",
            "Inclusion of methods of blacklist filtering from known sources (such as Encode) or in software derived blacklists (using GreyListChIP) should be performed.",
            "The output of BedGraph instead of BigWigs may cause some problems for users when working with larger genomes such as human or mouse. ",
            "BigWigs may not be able to be exported on Windows systems but users of Mac or linux should have this option available to them to make this feature worthwhile.",
            "Peak calling is performed with BayesPeak. ",
            "It is unclear how this performs on the different types of epigenetic marks used in this study. ",
            "Some more options for peak calling could be included here to allow finer control of the stitching of peaks into larger peaks. ",
            "A simple bin based peak calling approach such as implemented in the CSAW user guide would be useful here. ",
            "How the identification of replicated peaks is not clear in text and could be expanded.",
            "The example differential enrichment analysis compare H3k4me3 and H3K36me3 signals directly. ",
            "This is a strange example as most differential ChIP-seq analysis is performed within the same antibody. ",
            "An example comparing the change in one histone mark over different conditions/treatment/tissue types would be a more useful and relevant comparison.",
            "This differential enrichment example does highlight a potential pitfall with this approach where the majority of sites change. ",
            "The user should be warned in these circumstances as conclusions are likely to be invalid. ",
            "Alternative normalisations such as to total mapped reads in peaks or total mapped reads to genome could be provided as options (as in Diffbind)."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Recap",
            "Recap",
            "Todo",
            "Other",
            "Todo",
            "Todo",
            "Weakness",
            "Other",
            "Recap",
            "Weakness",
            "Todo",
            "Todo",
            "Todo",
            "Recap",
            "Weakness",
            "Todo",
            "Weakness",
            "Todo",
            "Todo"
        ],
        "pid": "8-1295",
        "domain": "rpkg"
    },
    {
        "id": "report2861",
        "sentences": [
            "Reviewer response for version 1",
            "Basunaid et al. describe a patient with a recurrent meningioma who ultimately developed pleural metastases. ",
            "The primary tumor was assigned to WHO grade II, and the recurrent tumor to grade III. ",
            "While this paper by itself does not provide truly novel information, in my view such rare patients should be reported in the literature. ",
            "This and similar reports will help to build a database which may at some point help to improve our understanding and management of rare conditions. ",
            "The report may benefit from a more comprehensive and detailed (tabular?) review of the literature."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Recap",
            "Strength",
            "Other",
            "Todo"
        ],
        "pid": "2-222",
        "domain": "case"
    },
    {
        "id": "report5253",
        "sentences": [
            "Reviewer response for version 1",
            "I fully agree with the reviewer from Bonn, Matthias Simon. ",
            "Meningiomas grade III are fortunately rare and they do metastasize through vascular pathways. ",
            "Of course a register of such cases would be a valuable tool to get an idea of the prevalence of such events. ",
            "The case reported by Basunaid is a tragic one as the patient asked for euthanasia one week after dismissal from hospital. ",
            "This shows that he could not be offered any therapeutic option able to provide enough solace for staying alive."
        ],
        "labels": [
            "Structure",
            "Other",
            "Other",
            "Other",
            "Recap",
            "Other"
        ],
        "pid": "2-222",
        "domain": "case"
    },
    {
        "id": "report3181",
        "sentences": [
            "Reviewer response for version 1",
            "In this case report, the authors offer a clinicopathologic description of a case of pericardial synovial sarcoma.",
            "There are several major points that need to be addressed:",
            "- The patient was treated neoadjuvantly with \"high dose\" ifosfamide, but the authors describe using 2000 mg/m2 per cycle, which is actually considered quite a low dose for treatment of sarcomas. ",
            "This is either an error (perhaps 2000 mg/m2 was given each day for 3, 4, or 5 days per cycle?) or a very low dose was used intentionally. ",
            "Regardless, the patient apparently benefitted with some tumor shrinkage, which allowed for surgical resection.\n",
            "- A description of the surgery is lacking. ",
            "We do not know how much pericardium was removed or if lymph nodes were sampled, as sarcomas are known to metastasize lymphatically as well as hematogenously.\n",
            "- Although postoperative EBRT was administered, there is no discussion about whether intraoperative XRT or proton therapy was considered.\n",
            "- Upon disease recurrence with a mediastinal mass and pleural effusion, a lobectomy and decortication was performed. ",
            "We are not told if malignant cells were seen in the pleural fluid, in which case the entire pleura would be considered contaminated.\n",
            "- Post-op, the patient was treated \"adjuvantly\" with docetaxel. ",
            "Here, the authors need to be careful to point out that single agent docetaxel is not considered standard therapy for synovial sarcoma, and adjuvant therapy after a metastasectomy is also quite a controversial strategy. ",
            "It would be wrong if readers interpreted this report as an endorsement of post-op single agent docetaxel after a metastasectomy.",
            "In summary, it is not clear what we learn from this case report except that the patient apparently sustained a partial tumor response to ifosfamide chemotherapy, tolerated an R1 or R2 surgery, and despite post-op radiation, sustained a regional/metastatic recurrence. ",
            "A more thorough discussion about the complexities and controversies of clinical decision making in patients such as this would make such case reports more informative to the audience."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Structure",
            "Weakness",
            "Todo",
            "Recap",
            "Weakness",
            "Weakness",
            "Weakness",
            "Recap",
            "Weakness",
            "Recap",
            "Todo",
            "Other",
            "Weakness",
            "Todo"
        ],
        "pid": "3-15",
        "domain": "case"
    },
    {
        "id": "report3725",
        "sentences": [
            "Reviewer response for version 1",
            "This is an interesting paper and is well written. ",
            "It would definitely help future clinicians who might encounter this rare diagnosis. ",
            "However I think that for the benefit of these clinicians the authors should include more details on the chemotherapy regimen, including the number of days ifosfamide was administered for and the frequency of the cycle. ",
            "More details about the surgery and radiation would also be helpful."
        ],
        "labels": [
            "Structure",
            "Strength",
            "Strength",
            "Todo",
            "Todo"
        ],
        "pid": "3-15",
        "domain": "case"
    },
    {
        "id": "report304",
        "sentences": [
            "Reviewer response for version 1",
            "This case report presents an interesting case of apparent hydranencephalic changes, in addition to more extensive developmental brain anomalies (lack of thalamus and basal ganglia). ",
            "However, including the points made below would make the manuscript much more useful as an educational resource:",
            "The manuscript would be enhanced if the author’s did more than just itemize a list of associated etiologies for hydranancephaly. ",
            "The authors should provide a paragraph explaining how any of these etiologies could specifically produce the anomalies observed (cerebral arterial stroke or spasm of which specific vessels) and perhaps contrast it with any syndromic or associated genomic alterations listings of similar brain findings (or at least provide evidence that they researched this aspect).",
            "I’m not sure all would accept this as a variant of the same processes that cause classic hydranencephaly since it appears to be so much more extensive anomalous formation of the final fetal brain. ",
            "The authors may have to do a little more research and discussion to support their contention based on how others who have written about hydranencphaly and define the condition.",
            "There are several grammatical errors (e.g. in the Abstract “such that absent cortex” is an incomplete phrase to end the sentence) which should be addressed, and I suggest the article is proof read again to ensure it reads how a published manuscript should do."
        ],
        "labels": [
            "Structure",
            "Strength",
            "Structure",
            "Todo",
            "Todo",
            "Weakness",
            "Todo",
            "Todo"
        ],
        "pid": "1-22",
        "domain": "case"
    },
    {
        "id": "report13921",
        "sentences": [
            "Reviewer response for version 1",
            "The paper is of interest. ",
            "The authors should give details of pupillary reactivity. ",
            "With herniation there is usually a change in pupillary size and reactivity before the ptosis. ",
            "Was this not the case here?"
        ],
        "labels": [
            "Structure",
            "Strength",
            "Todo",
            "Other",
            "Todo"
        ],
        "pid": "5-125",
        "domain": "case"
    },
    {
        "id": "report2977",
        "sentences": [
            "Reviewer response for version 1",
            "This article certainly raises awareness about the presence of melioidosis in Thai Myanmar border and the expanding map of melioidosis globally. ",
            "The two cases also reiterate the importance of timely diagnosis and appropriate chemotherapy for successful outcome. ",
            "This report also underscores the fact that there may be many undiagnosed cases in the region, because of low index of suspicion by the clinicians and lack of facility for diagnosis.",
            "However, a few points could have been included as follows:",
            "- Evidence from a random dextrose level test (432 mg/dL) and a urine dipstick was consistent with anorexia. ",
            "This statement is not clear. ",
            "It would have been better if a glycated hemoglobin value was available to rule out diabetes. ",
            "Additionally, further values of plasma glucose would have been helpful. ",
            "Also, the finding of the urinary dipstick is not mentioned.\n",
            "- It is not clear if the patient was treated for vivax malaria.\n",
            "- The course and events of the patient's hospitalization of 8 weeks has not been mentioned."
        ],
        "labels": [
            "Structure",
            "Strength",
            "Recap",
            "Recap",
            "Structure",
            "Recap",
            "Weakness",
            "Todo",
            "Todo",
            "Weakness",
            "Weakness",
            "Weakness"
        ],
        "pid": "3-4",
        "domain": "case"
    },
    {
        "id": "report3595",
        "sentences": [
            "Reviewer response for version 1",
            "F. Nosten and colleagues report two cases of fatal melioidosis in the Myanmar border and remind the international community that this disease was discovered in Myanmar. ",
            "Melioidosis is probably a forgotten public health issue in Myanmar and this article has the advantage of emphasizing it. ",
            "However a description of the Myanmar environment, healthcare system and available antibiotics could help to better understand the general background around these two cases.",
            "I have a few comments on the cases:",
            "The first case illustrates a chronic pulmonary melioidosis with a fatal septic choc due to B. pseudomallei .",
            "- “ lived in close proximity to the farm ” - ",
            "Could you please reinterate the context of the Myanmar border; are there irrigated rice fields in the area? ",
            "Is the patient in close contact with wet soil or any kind of water sources?\n",
            "- “ Abdominal examination revealed a 1 cm liver and spleen ” - ",
            "This statement is not really clear. ",
            "Do you mean that there are an hepatomegaly and a splenomegaly?\n",
            "- “ died more than 8 weeks after the onset of symptoms ” - ",
            "It would be more helpful to have the time from hospitalization.",
            "The second case is about a fatal disseminated melioidosis from cutaneous inoculation. ",
            "What is less clear is the global clinical presentation. ",
            "The patient had initial pulmonary oedema. ",
            "Maybe it would be helpful to discuss pulmonary melioidosis and to have the result of the chest X-ray (if it could have been done in this setting).",
            "- “ stool sample was noted to be of black color ” - ",
            "This statement doesn’t bring out any new evidence.\n",
            "- “ A second blood culture obtained one day prior to his death grew Burkholderia pseudomallei after one day of incubation .” - ",
            "Does that mean that you got the result after his death? ",
            "How long did it take to get the result?\n",
            "- Do the authors think that earlier result of blood cultures could have had a positive impact on the outcome of their two patients? ",
            "It could be interesting to discuss it.\n",
            "- Do the authors have any comments on the Ashdown media, which is a cheap, specific and easy-to-make medium. ",
            "Could it be implemented in the Myanmar border to help diagnosing cases?\n",
            "- Is ceftazidime available in Myanmar?"
        ],
        "labels": [
            "Structure",
            "Recap",
            "Strength",
            "Todo",
            "Structure",
            "Recap",
            "Recap",
            "Todo",
            "Todo",
            "Recap",
            "Weakness",
            "Todo",
            "Recap",
            "Todo",
            "Recap",
            "Weakness",
            "Recap",
            "Todo",
            "Recap",
            "Weakness",
            "Recap",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Todo"
        ],
        "pid": "3-4",
        "domain": "case"
    },
    {
        "id": "report4028",
        "sentences": [
            "Reviewer response for version 1",
            "The authors have reported two cases meliodosis in an area in which this disease was not believed to occur and make an important point about paucity of diagnostic technology in the region.",
            "Abstract:",
            "- “ We report the first two cases of fatal melioidosis in this region... ” ",
            "The phrasing of this sentence implies that these are the first actual cases of fatal meliod in the region, rather than the first formally diagnosed cases. ",
            "It currently implies that Meliod is a new/emerging disease to this region rather than a new diagnosis of a condition which is likely to have been present, but unrecognised.",
            "Presentation:",
            "- “ Presented below are two fatal case reports... ” ",
            "The case reports were not fatal. ",
            "\"Presented below are two case reports of fatal...” would be better.\n",
            "- The cases are a little brief on detail and if possible, it would be nice to make the corrections/additions suggested by the other two reviewers. ",
            "Having said that, the weakness of the case descriptions do not detract from the message regarding the description of Meliod in this setting.",
            "Diagnosis:",
            "- This is a challenging condition to diagnose and it is important to have a little more detail here – reassuring readers that this really was B. pseudomallei is the most important part of this paper. ",
            "The authors should have described the colonial morphology of the pathogen as B. pseudomallei has a characteristic appearance (although I would discourage them from re-culturing it simply to answer this point unless there is a safe laboratory environment to do so). ",
            "It would also have been useful to record the API20NE score (both the 7 digit number and the percentage ID).W",
            "What does SMRU stand for? ",
            "Lastly, what confirmatory test did MORU perform?",
            "Management:",
            "- It is a little unusual that management follows the discussion. ",
            "In particular, the last 2 sentences are conclusions and they should be separated and labelled as such."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Structure",
            "Recap",
            "Recap",
            "Recap",
            "Structure",
            "Recap",
            "Weakness",
            "Todo",
            "Todo",
            "Other",
            "Structure",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Structure",
            "Weakness",
            "Todo"
        ],
        "pid": "3-4",
        "domain": "case"
    },
    {
        "id": "report38948",
        "sentences": [
            "Reviewer response for version 1",
            "This is a description of management of a challenging clinical scenario given the non-specific diagnosis of the bleeding disorder in this patient with a desire for neuraxial anesthesia.",
            "I was curious about the airway exam, considering that the team would have to prepare the possibility of inducing general anesthesia. ",
            "I wonder if consideration was given to administering DDAVP or other treatment for von Willebrand's disease. ",
            "Was an arterial line placed or considered, and what was the intravenous access in place?",
            "I am curious about the components of the intrathecal medications for the single shot spinal anesthetic. ",
            "With the possibility for prolonged surgery, were any adjuvants, such as clonidine added to prolong the anesthetic?",
            "I would suggest editing the language in a few places. ",
            "Instead of \"epidurals\", suggest instead, \"labor epidural analgesia\". ",
            "Explain what is\"routine oxytocin\" in your institution. ",
            "For what period postoperatively was the patient \"closely monitored\" and how? ",
            "Were there nursing orders for frequent checks of neurologic status? ",
            "Finally, I would suggest discussing the reasons for the low incidence of epidural hematoma in the obstetric population and including this reference: Lee L, et al 1 ."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Other",
            "Todo",
            "Todo",
            "Other",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Todo"
        ],
        "pid": "7-1482",
        "domain": "case"
    },
    {
        "id": "report16722",
        "sentences": [
            "Reviewer response for version 1",
            "I understand that this article is included in the Elixir report collection and it does, in fact, read like a report. ",
            "If one is very familiar with Elixir, it probably makes sense, but if one isn't, then it is a bit confusing to read.",
            "But it contains valuable information that I think would be generally useful to everyone trying to develop methods for evaluating data resources. ",
            "In fact, an RFI put out by the US National Institutes of Health on repository metrics just closed today. ",
            "So if the authors are willing, I think that providing some modifications would make the report more readable to a general audience.",
            "- It would be nice if the first paragraph introduced Elixir a bit more and explained its structure. ",
            "This could be done through either a diagram or a reference. ",
            "But the Hub idea is critical to the governance of Core Data Resources proposed and it would be nice to make the structure clear.\n",
            "- The tense of the article is a bit unclear. ",
            "Are there already approved Core Data Resources that have been evaluated by the criteria outlined? ",
            "At times, it seems that way and other times, it seems like the process has not yet been implemented. ",
            "In Table 2, some examples that are considered \"core\" are given. ",
            "But in the text, it says that the resources in table 2 were identified as a \"seed list\" to inform Core Data Resources. ",
            "So it implies that they haven't yet gone through the process. ",
            "I think stating up front where you are in the process would make it less confusing.\n",
            "- Methods section: The term \"indicator\" is first used in second paragraph of the first section of methods section, but is not defined until the next section. ",
            "It should be defined earlier.\n",
            "- \"Legacy stage\" is used in the 3rd paragraph. ",
            "Legacy has a meaning in data-already existing-and so I think some definition is required here. ",
            "It is, in fact, defined in Table 1, so a reference to the Table would be sufficient.\n",
            "- The indicators are listed in the main text, again in Box 1 and again in Fig 2. ",
            "Seems like a bit of overkill. ",
            "Also, the purpose of the indicators is defined in multiple places and it is a bit repetitive, e.g., the explanation given under the section \"Detailed description of the indicators and related methodology\" really isn't necessary.\n",
            "- FAIR is introduced in Box 1, but not in the text at all. ",
            "It seems like it should be mentioned in the introduction to indicators in the methods as it is used as a set of criteria throughout Box 1.\n",
            "- Is there a timeline as to when the first core resources will be approved (if they haven't been already-see pt 2)"
        ],
        "labels": [
            "Structure",
            "Other",
            "Weakness",
            "Strength",
            "Other",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Weakness",
            "Todo",
            "Weakness",
            "Recap",
            "Recap",
            "Other",
            "Todo",
            "Weakness",
            "Todo",
            "Recap",
            "Todo",
            "Todo",
            "Recap",
            "Weakness",
            "Weakness",
            "Weakness",
            "Todo",
            "Todo"
        ],
        "pid": "5-2422",
        "domain": "iscb"
    },
    {
        "id": "report23943",
        "sentences": [
            "Reviewer response for version 1",
            "The authors have made a pipeline integrating differential RNA-Seq expression analysis with ChIP-Seq analysis and implemented it through the GenomeSpace platform. ",
            "Though as mentioned by the authors in the paper: this is a commonly performed bioinformatic task, their aim is to make this integrated analysis easily accessible to non-bioinformatic users. ",
            "For this purpose their workflow on the web-based workbench involves integrating multiple tools like Cuffdiff module in GenePattern (for Differential RNA-Seq analysis) with MACS2 in Galaxy (for ChIP-Seq analysis).",
            "Though the workflow presented by the authors seems easy to use by any biologist, it also appears to be severely limited not just in its scope of application but also in its choice of tools which are hardcoded. ",
            "For example the authors use \"CuffDiff\" for Differential RNA-Seq expression analysis. ",
            "The authors do not state why they chose this particular method or even why they chose its GenePattern module and not the Galaxy implementation. ",
            "Though admittedly this is a popular tool and has the advantage of transcript level analysis, it also suffers from known limitation of underestimating the number of differential genes. ",
            "Other count based method like DESeq2 tool (also implemented in Galaxy) might be better suited for most gene-level differential RNA-Seq analysis. ",
            "Also, the authors do not clearly explain why their workflow is better or easier for a biologist to implement than using the same tools through Galaxy directly (which has been made for a non-coding biologist). ",
            "I would argue that working directly on Galaxy even if slightly more complicated would be more rewarding to users as it offers not just greater flexibility of tools but also the option to select different parameters than default.",
            "Hence in conclusion, to make this manuscript better the authors should 1) provide a clearer explanation for their choice of tools and why is it easier/better to use their pipeline than the same tools on Galaxy directly, 2) If possible the authors should try to expand their workflow to provide a greater flexibility to the user to choose their tools for RNA-Seq and ChIP-Seq analysis."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Recap",
            "Recap",
            "Weakness",
            "Recap",
            "Weakness",
            "Weakness",
            "Other",
            "Weakness",
            "Other",
            "Todo"
        ],
        "pid": "6-784",
        "domain": "iscb"
    },
    {
        "id": "report24385",
        "sentences": [
            "Reviewer response for version 1",
            "In this article, the authors Perraudeau, Risso, Street, Purdom and Dudoit present a nice workflow for normalization, dimensionality reduction, clustering, and lineage inference of single-cell RNA-seq data (scRNA-seq) using R packages from the open-source Bioconductor project. ",
            "I enthusiastically agree with the authors on an “increasing need for workflows that integrate these tools to yield a seamless scRNA-seq data analysis pipeline” and this workflow is a great step in the right direction. ",
            "However, I have some constructive suggestions that will better integrate other previously developed work and improve this workflow.",
            "- In this workflow, the authors start with a count table. ",
            "However, the majority of researchers will start with raw reads (e.g. a FASTQ file). ",
            "It would be great if the author discussed current best practices for the quantification step of scRNA-seq data. ",
            "Alternatively, the authors could point to other references that have already been developed.\n",
            "- I would like to see the authors take advantage of the rich functionality and data exploration tools for cell- and gene-specific quality control (QC) introduced in low-level analysis workflows such as the one from Lun et al. (2016) 1 . ",
            "Also, in this workflow, the authors create multiple SummarizedExperiment objects (e.g. one with only the top 1000 highly variable genes (HVGs), one with all genes, etc). ",
            "This doesn’t seem efficient, especially with large single cell data sets such as the 1.3 million cells from embryonic mouse brains. ",
            "I think both of these concerns can now be addressed with efforts such as the recently developed SingleCellExperiment Bioconductor object ( https://github.com/drisso/SingleCellExperiment ). ",
            "For example, the authors could add a “USE” column in the gene- or cell-specific meta table to represent whether or not a particular gene in a particular cell met the filtering criteria applied. ",
            "The authors could store W in the reduceDim assay of the SingleCellExperiment object.\n",
            "- In ZINB-WaVE, the authors specify the number of dimensions for the low-dimensional space (K) to be K=50. ",
            "Could the authors add more details for the reader explaining why they picked K=50 and describe situations in which a user would want to specify a higher or lower K? ",
            "In particular, it would be useful to discuss computational time in terms of number of genes and cells. ",
            "Also, it would be useful to note that if you only wanted to use ZINB-WaVE to remove known covariates for normalization, you can use K=0.",
            "Minor comments:",
            "- When selecting the top 1000 HVGs, why do the authors not take into account the overall mean-variance relationship and only select genes based on the variance?\n",
            "- It would be great if the authors referenced other tools available for similar analyses currently available. ",
            "For example there are several available packages for normalization of scRNA-seq data, such as calculating global scaling factors can be done with scran ( https://bioconductor.org/packages/release/bioc/html/scran.html ) or gene and cell-specific scaling factors using SCnorm ( https://github.com/rhondabacher/SCnorm ). ",
            "Alternatively, users might want to try using relative transcript counts using Census ( https://bioconductor.org/packages/release/bioc/html/monocle.html )."
        ],
        "labels": [
            "Structure",
            "Strength",
            "Strength",
            "Other",
            "Recap",
            "Other",
            "Todo",
            "Todo",
            "Todo",
            "Recap",
            "Weakness",
            "Other",
            "Todo",
            "Todo",
            "Recap",
            "Todo",
            "Todo",
            "Todo",
            "Structure",
            "Todo",
            "Todo",
            "Other",
            "Other"
        ],
        "pid": "6-1158",
        "domain": "iscb"
    },
    {
        "id": "report24387",
        "sentences": [
            "Reviewer response for version 1",
            "The authors have developed an easy to follow workflow which goes beyond preparing single-cell data for analysis, showing how to use existing methods and packages to normalize, perform dimension reduction, construct cell lineages and perform differential testing along those lineages. ",
            "The workflow seems like it will be useful, and I hope the authors can update the workflow as new frameworks come into play (e.g. SingleCellExperiment).",
            "I have the following suggestions for improving the workflow:",
            "It would be useful to put a link to the source code (or to the section where the link to the source code exists) near the top of the document.",
            "I was confused a bit by \"the first major bifurcation in the HBC lineage trajectory occurs prior to cell division\". ",
            "Can you be more specific about what you are referring to here by cell division, as without knowledge of the system, I'm not sure where the cell division you refer to should appear.",
            "\"within a single object\": It may be good to explain what an \"object\" here is. ",
            "You could, for example, refer to Figure 2 of the Bioconductor Nature Methods paper 1 .",
            "Misspelling: \"reasonnable\"",
            "On filtering for most variable genes, I understand this decision, and I also recommend it during workshops before making ordination plots. ",
            "I know that students are not always certain why we care about variance (unsupervised). ",
            "I like to mention that these are the genes where the \"action\" is. ",
            "A side point, the log(x+1) is not variance stabilizing for RNA-seq counts in general. ",
            "This filter can give higher priority to low count genes than to genes where there is interesting biological variability (though I do not doubt that the very high biological variance genes will be preserved). ",
            "It might be useful to show a vsn::meanSdPlot() for the matrix log1p(assay(se))?",
            "\"correcting for batch effects\": What are batch effects? ",
            "(Of course, I know what they are, but a reader may not, and you could cite some of the single cell literature here.)",
            "\"Note that, in this case, the low-dimensional matrix W is not included in the computation of residuals to avoid the removal of the biological signal of interest.\": I understood this sentence only on a second pass through. ",
            "One problem is that you haven't defined W in the text yet (only in Figure 4). ",
            "I would only reference the matrix W if you have defined it.",
            "Figure 6: ",
            "Can you change the figure width so that PC1 is not squished?",
            "Is there a circularity to the recovery of published clusters in Figure 6? ",
            "Was ZINB-WaVE used in Fletcher (2017)?",
            "Can you say what the meaning of the color white is in Figure 8 (in the text or caption near this figure)?",
            "Figure 15 refers back to Figure 2 but does not use the same color scheme for the known cell types, so the reader cannot verify if you've recovered the lineages from the publication. ",
            "It would be good therefore to have a legend for these figures (Fig 15 and following) indicating which cell types the colors refer to (this information is in the unlabeled table above, but should be included as a legend here).",
            "Can you briefly describe what a GAM is ahead of Figure 17?"
        ],
        "labels": [
            "Structure",
            "Recap",
            "Strength",
            "Structure",
            "Todo",
            "Weakness",
            "Todo",
            "Todo",
            "Todo",
            "Weakness",
            "Strength",
            "Other",
            "Other",
            "Other",
            "Other",
            "Todo",
            "Todo",
            "Todo",
            "Weakness",
            "Weakness",
            "Todo",
            "Structure",
            "Todo",
            "Todo",
            "Todo",
            "Todo",
            "Weakness",
            "Todo",
            "Todo"
        ],
        "pid": "6-1158",
        "domain": "iscb"
    },
    {
        "id": "report24388",
        "sentences": [
            "Reviewer response for version 1",
            "Major comments:",
            "- There is something wrong with the data download link in the F1000 version so that I am unable to download these files and actually reproduce the workflow. ",
            "I experimented a bit to see if I could figure out how to download the data anyways, but will reserve further evaluation of this submission until this issue can be resolved by the authors. ",
            "```{r} urls = c(\"https://www.ncbi.nlm.nih.gov/geo/download/?acc=GSE95601&format=file&file=GSE95601%5FoeHBCdiff% \"https://raw.githubusercontent.com/rufletch/p63-HBC-diff/master/ref/oeHBCdiff_clusterLabels.) ```\n",
            "- a. ",
            "This workflow will likely be out-of-date when the underlying packages transition to use SingleCellExperiment. ",
            "This is actually a positive thing because many of the more opaque lines of code (involving subsetting ERCC genes, etc) will be more streamlined. ",
            "b. ",
            "It requires installation of the development branch of bioconductor, which impacts the usefulness of the workflow to the average user. ",
            "I expect the authors will revise this tutorial when Bioconductor 3.6 is released and use of the devel branch is no longer necessary. ",
            "Additionally `slingshot` is an requirement, but currently only exists on github and no SHA1 provided. ",
            "I hope that `slingshot` will be added as a bioconductor package shortly. ",
            "In the meantime, a tag must be added to the git repo for the release being used in this workflow and instructions provided for how to install this tag. ",
            "Additionally, the authors may wish to note that installation instructions for the packages will be provided at the end of the workflow so that someone proceeding sequentially will not be tripped up. ",
            "c.O",
            "Opaque code is presented in order to generate plots, e.g. ```{r} palDF <- ceObj@clusterLegend[[1]] ",
            "pal <- palDF[, \"color\"] names(pal) <- palDF[, \"name\"] pal[\"-1\"] = \"transparent\" plot(fit$points, col = pal[primaryClusterNamed(ceObj)], main = \"\", pch = 20, xlab = \"Component1\", ylab = \"Component2\") legend(x = \"topleft\", legend = names(pal), cex = .5, fill = pal, title = \"Sample\") ``` ",
            "While this complexity may be necessary, perhaps some of it could be encapsulated as accessor functions in the package? ",
            "Too much complexity here may cause users to miss the forest for the trees.\n",
            "- The authors could better motivate (or at least explain the impact of) some of the default parameters and procedures.",
            "- Why do we set a zcut threshold of 3 for the `scone` filtering?\n",
            "- Why K=50 for zinbwave?\n",
            "- RSEC parameters How should a user decide on a value for these parameters?"
        ],
        "labels": [
            "Structure",
            "Structure",
            "Weakness",
            "Other",
            "Other",
            "Structure",
            "Weakness",
            "Strength",
            "Structure",
            "Weakness",
            "Todo",
            "Weakness",
            "Todo",
            "Todo",
            "Todo",
            "Structure",
            "Recap",
            "Other",
            "Todo",
            "Weakness",
            "Todo",
            "Todo",
            "Todo",
            "Todo"
        ],
        "pid": "6-1158",
        "domain": "iscb"
    },
    {
        "id": "report19605",
        "sentences": [
            "Reviewer response for version 1",
            "This paper describes the PathLinker Cytoscape app, including the mathematical algorithms and a comparison to similarly-focused Cytoscape apps. ",
            "It is well written and address the important problem of deducing relationships that can advance biology.",
            "It is very economical in its explanation of the app/algorithm, its uses and its relationship to other apps, and in several places needs more explanation. ",
            "Explanations tend to weigh in favor of expert Cytoscape users, though this app would be of interest to less expert users, too, particularly those trying to relate PathLinker to biological investigation. ",
            "The paper would benefit from better enabling the reader to follow a use case in Cytoscape using actual data and actual app settings.",
            "- In Methods | Operation, please explain how to acquire and run PathLinker.\n",
            "- In \"Allow sources and targets in paths\" and \"Targets are identical to sources\", please explain the biological implications of these settings ... ",
            "it's difficult to jump from the graph implications to the biological implications.\n",
            "- In \"Algorithm\", why is the default chosen, and what are the biological ramifications of choosing a higher or lower k ?\n",
            "- The output in Figure 2B seems to be a standalone window. ",
            "How can the user capture the results? ",
            "It's unclear how the user should be using this report in investigating relationships.\n",
            "- In \"Edge penalty\", please explain when a edge penalty would be used in a network and what its biological implication would be.\n",
            "- In \"Input datasets and pre-processing\", I attempted to download the ToxCost data and could not. ",
            "The site requires a credential and does not give instructions regarding how to get the credential. ",
            "Without this data, the user is hard pressed to reproduce these results and then evolve his/her own questions. ",
            "The web site apparently identifies this data as freely available. ",
            "Can it be included as supplementary material (as a Cytoscape session file?) to assist the user in following this paper?\n",
            "- In \"Input datasets and pre-processing\", I tracked down the referenced original PathLinker paper. ",
            "It took a while to determine which network was being used. ",
            "I downloaded it and imported it into Cytoscape. ",
            "During the import, there were a number of options available, and it was unclear which options should be chosen. ",
            "Can this network be included as supplementary material (as a Cytoscape session file?) to assist the user in following this paper?\n",
            "- In \"Running PathLinker\", can you explain the biological ramifications behind the k =50 and edge penalty settings?\n",
            "- In \"Further Analysis\", can you explain which Cytoscape tool or feature you used to spread the nodes apart? ",
            "I'm thinking of the biological user that's trying to follow the paper.\n",
            "- In \"Functional Enrichment\", can you specify which ClueGO settings you used? ",
            "This is a very valuable step, and it's hard for the user to follow without giving settings.\n",
            "- In \"Running Time\", how many CPU cores and how much RAM were on the test machine?\n",
            "- In the \"Comparison to related Cytoscape Apps\", the discussion focuses on differences in graph analysis approaches, and assumes the reader can appreciate the reasons why PathLinker gives better results. ",
            "The discussion could use a little more justification, and also some grounding in the biological consequences of these differences.\n",
            "- In the Introduction, the claim \"any human signaling pathway\" is overbroad. ",
            "I suggest claiming \"human signaling pathways\"."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Strength",
            "Todo",
            "Other",
            "Todo",
            "Todo",
            "Todo",
            "Weakness",
            "Todo",
            "Other",
            "Todo",
            "Weakness",
            "Todo",
            "Weakness",
            "Other",
            "Other",
            "Other",
            "Todo",
            "Other",
            "Weakness",
            "Other",
            "Weakness",
            "Todo",
            "Todo",
            "Todo",
            "Other",
            "Todo",
            "Weakness",
            "Todo",
            "Recap",
            "Todo",
            "Weakness",
            "Todo"
        ],
        "pid": "6-58",
        "domain": "iscb"
    },
    {
        "id": "report20283",
        "sentences": [
            "Reviewer response for version 1",
            "The paper of Gil et al. describes a new Cytoscape App, Pathlinker, which is the Cytoscape implementation of the previously published approach by the Murali group with the same name. ",
            "It is always useful for the community to implement network analyzing algorithms to Cytoscape.",
            "The paper and the abstract is well written and clear. ",
            "The figures were well selected.",
            "In order to facilitate the application of the PathLinker App, it would be useful to provide more, tutorial type comments and guidelines for new users. ",
            "Given the important task PathLinker is meant to solve, many users would find it useful. ",
            "Currently the Methods section contains the key steps but it does not read as a protocol or suggest alternatives for troubleshooting.",
            "The current version of the paper does not contain the limitations of PathLinker. ",
            "When this App should not be used, for which datatypes it is not good, or cases when the user should pay attention to any bias or problem?",
            "The comparison with existing Apps focuses on the differences in the algorithms. ",
            "As this is an App paper, it would be useful to include a comparison of the functional differences (features) between the Apps.",
            "If possible, maybe for a new version, it would be nice if the App allows to input the source and target node names by node selection function, instead of typing it in (or pasting it in) to the requested fields.",
            "Finally, a small bug in the App: When the user select the checkbox to generate a sub-network as an output, it does not generate a subnetwork within Cytoscape but a new network. ",
            "The problem with this that it means the attributes of the original network will be lost. ",
            "This should be fixed easily.",
            "I believe PathLinker will be a popular and often used App for the biomedical and systems biology communities. ",
            "I think the next step to increase its impact is to make the application of it as clear and as didactical as possible."
        ],
        "labels": [
            "Structure",
            "Recap",
            "Strength",
            "Strength",
            "Strength",
            "Todo",
            "Other",
            "Weakness",
            "Weakness",
            "Todo",
            "Recap",
            "Todo",
            "Todo",
            "Weakness",
            "Other",
            "Todo",
            "Strength",
            "Todo"
        ],
        "pid": "6-58",
        "domain": "iscb"
    }
]